Rating/Request/TC11000087.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://wsc.tdigi/calculatepremium/calculateautopremium/request/v4">	<soapenv:Header/>	<soapenv:Body>		<v4:calculateAutoPremium>			<CalculateAutoPremiumRequest>				<AutomobilePolicy>					<PortfolioNumber>003896081</PortfolioNumber>					<ContractNumber>0000000000663</ContractNumber>					<EffectiveDate>T00:01:00-05:00</EffectiveDate>					<IsAutomaticRating>true</IsAutomaticRating>					<IsOriginalContract>true</IsOriginalContract>					<EndDate>T00:01:00-05:00</EndDate>					<RatingSource>CallCenter</RatingSource>					<Insurer>						<InsurerName/>											</Insurer>					<LineOfBusiness>AUTOMOBILE</LineOfBusiness>					<VersionEffectiveDate>T00:01:00-05:00</VersionEffectiveDate>					<RateDate>-05:00</RateDate>					<ClientGroupNumber/>					<RatingGroupNumber/>					<TransactionType>NewBusiness</TransactionType>					<Address>						<DisplayPostalZipCode>T3R0E3</DisplayPostalZipCode>						<DisplayProvinceState>NB</DisplayProvinceState>					</Address>					<AutomobilePolicyCounters>
	<AutomobilePolicyCounter>
		<VehicleType>AT</VehicleType>
	</AutomobilePolicyCounter>
	<AutomobilePolicyCounter>
		<VehicleType>AU</VehicleType>
	</AutomobilePolicyCounter>
	<AutomobilePolicyCounter>
		<VehicleType>MC</VehicleType>
	</AutomobilePolicyCounter>
	<AutomobilePolicyCounter>
		<VehicleType>MH</VehicleType>
	</AutomobilePolicyCounter>
	<AutomobilePolicyCounter>
		<VehicleType>SM</VehicleType>
	</AutomobilePolicyCounter>
	<AutomobilePolicyCounter>
		<VehicleType>TF</VehicleType>
	</AutomobilePolicyCounter>
	<AutomobilePolicyCounter>
		<VehicleType>UT</VehicleType>
	</AutomobilePolicyCounter>
</AutomobilePolicyCounters>					<Coverages/>					<Vehicles><Vehicle><EffectiveDate>T00:01:00-05:00</EffectiveDate><IsActive>true</IsActive><IsRatedByValue>false</IsRatedByValue><PurchaseDate>2018-06-01-05:00</PurchaseDate><PurchasePrice/><VehicleNumber>1</VehicleNumber><VehicleType>MC</VehicleType><SubVehicleType>MC</SubVehicleType><RSPInformation><IsRSPAssignedByAnalyst>false</IsRSPAssignedByAnalyst></RSPInformation><ProtectionDevices><ProtectionDevice><ProtectionDeviceCode/></ProtectionDevice></ProtectionDevices><VehicleRatingGroup><AccidentBenefit/><Collision/><Comprehensive/><ThirdParty/></VehicleRatingGroup><MakeModel><IsAntique>false</IsAntique><IsFiberglass>false</IsFiberglass><IsHighPerformance>false</IsHighPerformance><IsModernClassic>false</IsModernClassic><IsModifiedVehicle>false</IsModifiedVehicle><IsNewVehicle>true</IsNewVehicle><IsOlderVehicle>false</IsOlderVehicle><IsWinterTire>false</IsWinterTire><Year/><CCNumber>true</CCNumber></MakeModel><RatingVehicleInfo><IsAddedOnPolicyVersion>false</IsAddedOnPolicyVersion><IsCappingEvaluationRequired>false</IsCappingEvaluationRequired><IsRenewed>false</IsRenewed></RatingVehicleInfo></Vehicle></Vehicles>					<VehicleDriverUsages>						<VehicleDriverUsage>							<AnnualMileage>10000</AnnualMileage>							<BusinessMileage>0</BusinessMileage>							<WorkMileage>0</WorkMileage>							<DriverNumber>1</DriverNumber>							<VehicleNumber>1</VehicleNumber>							<Risk>								<RateDate>-05:00</RateDate>								<Territory><RiskPostalCodeFSA>TC1</RiskPostalCodeFSA><RiskPostalCodeLDU>100</RiskPostalCodeLDU></Territory>								<Coverages/>								<DiscountSurcharges>
	<DiscountSurcharge>
		<DiscountSurchargeCode>R3</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>R7</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>R9</DiscountSurchargeCode>
		<IsActive>true</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>R10</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>CAP</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>DISCG</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>DISML</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>R3O</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>DISRC</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>CAPMA</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>DISHY</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>DISR1</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>DISR4</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>SURD1</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>SURD5</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>DISMT</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
	<DiscountSurcharge>
		<DiscountSurchargeCode>DISMB</DiscountSurchargeCode>
		<IsActive>false</IsActive>
	</DiscountSurcharge>
</DiscountSurcharges>							</Risk>							<UBIVehicleDriverDiscount/>							<CurrentVehicleUsageType>Principal</CurrentVehicleUsageType>						</VehicleDriverUsage>					</VehicleDriverUsages>					<DriverInformations/>					<DriverVehicleList/>															<Territory><RiskPostalCodeFSA>TC1</RiskPostalCodeFSA><RiskPostalCodeLDU>100</RiskPostalCodeLDU></Territory>				</AutomobilePolicy>			</CalculateAutoPremiumRequest>			<EnvironmentIdentification>				<EnvironmentID>F01</EnvironmentID>			</EnvironmentIdentification>		</v4:calculateAutoPremium>	</soapenv:Body></soapenv:Envelope>